import React from "react";
import "./Home.css"; 
import { FaRegLemon } from "react-icons/fa";

function Home() {
  return (
    <div className="home-container">
      <h1 className="company-name"><FaRegLemon />sQuizzy</h1>
      <p className="welcome-text">
        Ласкаво просимо на головну сторінку нашого квізу! Ми спеціалізуємося на
        створенні захоплюючих та пізнавальних квізів для всіх любителів
        інтелектуальних ігор. Наші квізи охоплюють різноманітні теми, від історії
        та науки до фільмів і автомобілів. 
      </p>
      <p className="welcome-text">
        <strong>Про нас:</strong> Наша мета - зробити навчання і розваги
        веселими та доступними для кожного. Ми постійно оновлюємо наші
        питання і теми, щоб ви могли знайти щось нове і цікаве кожного разу,
        коли граєте в наші квізи.
      </p>
      <p className="welcome-text">
        <strong>Про наші квізи:</strong> Ми пропонуємо квізи на різні теми з
        різними рівнями складності. Ви можете вибрати категорію, визначити
        кількість питань та перевірити свої знання. Наші квізи розроблені для
        того, щоб бути цікавими, інформативними і, найголовніше, веселими!
      </p>
    </div> 
  );
}

export default Home;
